app/controllers/trips_controller.rb

INSERT INTO "trips" ("created_at", "date", "flag", "from_latitude", "from_longitude", "from_string", "time", "to_latitude", "to_longitude", "to_string", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @trip = Trip.new(from_string: params[:post_from],to_string: params[:post_to],date: Date.parse(params[:post_date]),flag: params[:rolepost]=='driver'?0:1,time: Time.parse(params[:post_time]))

    respond_to do |format|
      if @trip.save