app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "310589"]]
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @user = User.find(params[:uid])

SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1459003407"]]
DELETE FROM "users" WHERE "users"."uid" = ?  [["uid", "1459003407"]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy