app/controllers/userhome_controller.rb

  def index
  @trips_passengers = Trip.where("flag = ? and availabilty > 0", 1).order("updated_at desc")
---
SELECT "trips".* FROM "trips" WHERE (flag = 1) ORDER BY updated_at desc

  def search
    trips_passengers_result = Array.new;
    trips_drivers_result = Array.new;
    search_date_formatted = Date.strptime(params[:search_date], '%m/%d/%Y')
   # render :text => search_date_formatted
    if (params[:role] == "passenger")
      trips_passengers_result = Trip.where("from_string = ? AND to_string = ? AND flag =? AND date >= ?", params[:search_from], params[:search_to], 1, search_date_formatted)
---
SELECT "trips".* FROM "trips" WHERE (from_string = 'Santa Barbara' AND to_string = 'Los Angeles' AND flag =1 AND date >= '2012-11-01')